-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: 2017-10-26 08:28:25
-- 服务器版本： 5.7.18
-- PHP Version: 7.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `hws`
--

-- --------------------------------------------------------

--
-- 表的结构 `homework`
--

CREATE TABLE `homework` (
  `id` int(11) NOT NULL COMMENT '主键',
  `uid` int(11) NOT NULL COMMENT '用户id',
  `hw_url` varchar(100) NOT NULL COMMENT '作业url',
  `hw_num` int(11) NOT NULL COMMENT '作业序次',
  `class` varchar(1) DEFAULT NULL COMMENT '作业等级',
  `hw_comment` varchar(1000) DEFAULT NULL COMMENT '评语',
  `time` datetime NOT NULL COMMENT '上交时间',
  `comment_time` date DEFAULT NULL COMMENT '评价时间'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='作业表';

-- --------------------------------------------------------

--
-- 表的结构 `notice`
--

CREATE TABLE `notice` (
  `id` int(11) NOT NULL COMMENT '主键',
  `title` varchar(50) NOT NULL COMMENT '主题',
  `content` varchar(1000) NOT NULL COMMENT '内容',
  `status` varchar(1) NOT NULL COMMENT '状态',
  `hw_num` varchar(1) NOT NULL COMMENT '作业序次',
  `time` date NOT NULL COMMENT '时间',
  `end_time` datetime DEFAULT NULL COMMENT '截止时间'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='公告表';

--
-- 转存表中的数据 `notice`
--

INSERT INTO `notice` (`id`, `title`, `content`, `status`, `hw_num`, `time`, `end_time`) VALUES
(1, '国庆假期作业', '师弟师妹们看完师兄上传的学习资料，以<b style=\"color: red\">网页形式</b>制作<b style=\"color: red\">自我介绍页面</b>要求：<br>\r\n1.要有照片&nbsp;&nbsp;2.兴趣爱好&nbsp;&nbsp;3.座右铭&nbsp;&nbsp;4.自由添加其他内容&nbsp;&nbsp;5.先压缩后提交，作业命名方式：名字+国庆作业。<br><span style=\"color: red\">不懂的可以问我们！</span>附学习网站：<a href=\"http://www.w3school.com.cn/html/index.asp\">W3school</a>&nbsp;&nbsp;<a href=\"http://www.imooc.com/\">慕课网</a>', '1', '1', '2017-10-26', '2017-10-09 00:00:00'),
(2, '第一轮考核作业', '利用所学的 HTML 标签元素，制作一个<b style=\"color: red; font-size: 16px\">用户登录页面</b>和一个<b style=\"color: red; font-size: 16px;\">用户注册页面</b>，只需做静态页面即可，不用实现业务逻辑。可使用自学的新知识，尽量发挥你们的想法和创意，使页面更加漂亮！', '1', '2', '2017-10-26', '2017-10-21 18:00:00'),
(3, '第二次培训作业', '将一轮考核作业的两个静态网页（登录页和注册页）改成<b style=\"color: red; font-size: 18px\">ASP.NET控件的动态网页</b>。', '1', '3', '2017-10-26', '2017-10-28 18:00:00');

-- --------------------------------------------------------

--
-- 表的结构 `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL COMMENT '主键',
  `uname` varchar(6) NOT NULL COMMENT '用户名',
  `Sno` varchar(11) NOT NULL COMMENT '学号',
  `sex` varchar(1) DEFAULT NULL COMMENT '性别',
  `password` varchar(32) NOT NULL COMMENT '密码',
  `w_status` varchar(1) DEFAULT NULL COMMENT '作业状态',
  `u_status` varchar(1) DEFAULT NULL COMMENT '用户状态',
  `token` varchar(32) DEFAULT NULL COMMENT 'token'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='用户表';

--
-- 转存表中的数据 `users`
--

INSERT INTO `users` (`id`, `uname`, `Sno`, `sex`, `password`, `w_status`, `u_status`, `token`) VALUES
(1, '惠烽-傻瓜', '222', '女', '222', '0', '1', '8328011614145d0a306e79f24e996549'),
(2, '徐航-傻', '666', '女', '666', '0', '1', '3297d127b0c3a3f7748e3cc600bcaa36'),
(4, 'admin', '16115072000', '男', '888', '0', '1', ''),
(5, 'admin2', '1611507033', '男', '888', '0', '1', ''),
(6, '黄冠润', '16115072003', '男', '204472862', '0', '1', ''),
(7, '余晓鹏', '16101101035', '男', '740004078', '0', '1', ''),
(8, '吴镜杰', '16115073004', '男', '1422152595', '0', '1', NULL),
(9, '凌活龙', '17101071016', '男', '1967471283', '0', '1', NULL),
(10, '卢健聪', '17101081022', '男', '1596715459', '0', '4', ''),
(11, '钟晓琳', '17107011079', '女', '2623955813', '0', '4', NULL),
(12, '何健祖', '17104062031', '男', '773981398', '0', '1', NULL),
(13, '马秋绿', '17129013033', '女', '953780128', '0', '1', NULL),
(14, '邓瑾莲', '17114091034', '女', '2963282498', '0', '1', NULL),
(15, '何冠鹏', '17111014019', '男', '1420283844', '0', '1', NULL),
(16, '叶金镕', '17129031040', '女', '907265807', '0', '4', NULL),
(17, '蔡荣声', '', '男', '2060808858', '0', '4', NULL),
(18, '刘明杰', '17101071003', '男', '1271065093', '0', '1', NULL),
(19, '朱富鸿', '17115031045', '男', '1468169244', '0', '4', NULL),
(20, '李振', '17118041033', '男', '2650316229', '0', '1', NULL),
(21, '钟冠伦', '16109061027', '男', '549521435', '0', '1', NULL),
(22, '吴懿', '', '男', '302600081', '0', '1', NULL),
(23, '卢泽智', '17115073039', '男', '1072316240', '0', '1', NULL),
(24, '梁颢耀', '17101024038', '男', '1925481969', '0', '1', NULL),
(25, '林亮', '16101071040', '男', '1764037195', '0', '1', NULL),
(26, '欧东坤', '17110031001', '男', '1493155516', '0', '1', NULL),
(27, '叶诗诗', '', '男', '1664397420', '0', '4', NULL),
(28, '王瑞', '16101073001', '男', '2373736890', '0', '1', NULL),
(29, '曾嘉威', '17107011080', '男', '1969974531', '0', '4', NULL),
(30, '冼志斌', '17101101014', '男', '616768078', '0', '1', NULL),
(31, '朱子龙', '17104032012', '男', '1803167898', '0', '4', NULL),
(32, '汪雨霞', '17110041001', '女', '2324692124', '0', '1', NULL),
(33, '李月权', '17101071041', '男', '1098716811', '0', '4', NULL),
(34, '黄家鸿', '17101071005', '男', '2448837560', '0', '4', NULL),
(35, '吴磊', '17101071022', '男', '596717584', '0', '1', NULL),
(36, '李日桦', '17101101042', '男', '837765028', '0', '4', NULL),
(37, '欧烨标', '17101072031', '男', '1083110985', '0', '4', NULL),
(38, '蒋冠万', '17101071015', '男', '2632490139', '0', '1', NULL),
(39, '姚家欣', '17101072023', '男', '764666735', '0', '4', NULL),
(40, '郭铭扬', '17101023034', '男', '3130213701', '0', '4', NULL),
(41, '邓光远', '17101023042', '男', '953644541', '0', '4', NULL),
(42, '罗梓涛', '17101071004', '男', '2868127005', '0', '1', NULL),
(43, '李培明', '17101071048', '男', '1150643446', '0', '1', NULL),
(44, '聂红兵', '17101023049', '男', '2030249091', '0', '4', NULL),
(45, '梁栋平', '17101023044', '男', '1252125071', '0', '4', NULL),
(46, '江福', '17101102025', '男', '997407575', '0', '1', NULL),
(47, '曾思瑜', '17129011022', '女', '2469128902', '0', '4', NULL),
(48, '郑铭智', '17101021011', '男', '506769292', '0', '1', NULL),
(49, '叶妙欣', '17101071007', '女', '384978123', '0', '4', NULL),
(50, '罗欣怡', '17110021039', '女', '870757240', '0', '4', NULL),
(51, '萧泽健', '17101023003', '男', '1771097587', '0', '4', NULL),
(52, '赖燚', '17101071019', '男', '517234140', '0', '1', NULL),
(53, '余嘉鑫', '17101023050', '男', '896409274', '0', '1', NULL),
(54, '林泽锴', '17129032021', '男', '798364886', '0', '4', NULL),
(55, '黄干凯', '17101071017', '男', '1909472570', '0', '1', NULL),
(56, '陆升豪', '17101071042', '男', '1470411256', '0', '1', NULL),
(57, '梁智明', '17101071032', '男', '1825846332', '0', '1', NULL),
(58, '莫金萍', '17101091013', '女', '2507125082', '0', '4', NULL),
(59, '方健炜', '16115071054', '男', '373481766', '0', '1', NULL),
(60, '苏颖康', '17115062050', '男', '1391882712', '0', '1', NULL),
(61, '麦燕清', '17101042018', '男', '1940931605', '0', '1', NULL),
(62, '陈秋育', '17115021013', '男', '1906939484', '0', '4', NULL),
(63, '吴泳霖', '17109022005', '女', '1353339429', '0', '4', NULL),
(64, '彭炜', '17109021019', '女', '010101010', '0', '1', NULL),
(65, '苏毓洲', '17115073059', '男', '1404031711', '0', '1', NULL),
(66, '蔡晓洁', '', '男', '1300416188', '0', '4', NULL),
(67, '李梓欣', '17104051050', '女', '2467673987', '0', '4', NULL),
(68, '黄祖威', '17115032002', '男', '690696047', '0', '4', NULL),
(69, '罗豪明', '17115032015', '男', '1060748574', '0', '1', NULL),
(70, '郑乔锋', '17115032047', '男', '2291282646', '0', '4', NULL),
(71, '陈浩南', '17101101026', '男', '506463961', '0', '1', NULL),
(72, '汤敬聪', '17104012029', '男', '846052962', '0', '1', NULL),
(73, '庄晓卿', '17107032044', '女', '582695677', '0', '4', NULL),
(74, '李晓诚', '17101102020', '男', '1084952668', '0', '1', NULL),
(75, '程晖', '16109061011', '男', '1147939031', '0', '1', NULL),
(76, '翁青青', '17114091028', '女', '847554362', '0', '4', ''),
(77, '林观麒', '16115072045', '男', '1129673383', '0', '1', NULL),
(78, '欧丽娟', '17107032036', '女', '1345942525', '0', '1', NULL),
(79, '郑锋', '17110031039', '男', '1149290863', '0', '1', NULL),
(80, '李明景', '17115061047', '男', '1271165028', '0', '4', NULL),
(81, '高卓茹', '17114091071', '女', '965318195', '0', '4', NULL),
(82, '刘永康', '17101071038', '男', '2707545075', '0', '4', NULL),
(83, '陈艳云', '17115021043', '女', '1549346129', '0', '4', NULL),
(84, '黄锦乐', '17101023059', '男', '1605850475', '0', '4', NULL),
(85, '彭彦彬', '17115032042', '男', '593755659', '0', '4', NULL),
(86, '盘柏岐', '17101021008', '男', '1979221851', '0', '4', NULL),
(87, '陈锴霖', '16101072040', '男', '390329720', '0', '1', NULL),
(88, '陈聪贤', '17115071048', '男', '2184996488', '0', '1', NULL),
(89, '王蕴健', '17115071056', '男', '1849085272', '0', '4', NULL),
(90, '李国镔', '17104063008', '男', '1067397044', '0', '4', NULL),
(91, '吴国煌', '17101091006', '男', '739406132', '0', '1', NULL),
(92, '陈勇', '17101023013', '男', '314315859', '0', '1', NULL),
(93, '邵秋月', '17114091076', '女', '1434239022', '0', '1', NULL),
(94, '张淋柏', '17102101019', '男', '1091024494', '0', '1', NULL),
(95, '何蕴泽', '17101091035', '男', '1315585950', '0', '1', NULL),
(96, '陈思鸿', '17215051013', '男', '654996418', '0', '1', NULL),
(97, '许沛松', '17110031025', '男', '575804133', '0', '1', NULL),
(98, '符然壹', '17115021007', '女', '1525053329', '0', '1', NULL),
(99, '唐钰荣', '17215051016', '男', '2463604327', '0', '4', NULL),
(100, '徐浩源', '17215051005', '男', '1823605807', '0', '4', NULL),
(101, '黄国旺', '', '男', '769170883', '0', '4', NULL),
(102, '张高亮', '16115072021', '男', '1351019870', '0', '1', NULL),
(103, '龚雀', '16115072047', '男', '2634149526', '0', '1', NULL),
(104, '蔡晓玲', '17114091027', '女', '2695689632', '0', '4', NULL),
(105, '李庆婷', '17108014037', '女', '1801939554', '0', '4', NULL),
(106, '张浩', '17115061032', '男', '905646794', '0', '1', NULL),
(107, '洪德良', '17115072046', '男', '1392415748', '0', '1', NULL),
(108, '庄炎松', '17101024029', '男', '1377420280', '0', '1', NULL),
(109, '许浩星', '17115072010', '男', '1174988219', '0', '1', NULL),
(110, '罗文康', '17101024051', '男', '841282873', '0', '1', NULL),
(111, '陈家欣', '', '男', '565444295', '0', '4', NULL),
(112, '蚁少媚', '', '男', '1035750673', '0', '4', NULL),
(113, '左贝妮', '17102011022', '女', '493396522', '0', '4', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `user_infos`
--

CREATE TABLE `user_infos` (
  `uid` int(11) NOT NULL,
  `realname` varchar(10) CHARACTER SET utf8 DEFAULT NULL,
  `nickname` varchar(50) CHARACTER SET utf8 DEFAULT NULL,
  `sex` tinyint(1) DEFAULT '0',
  `college` varchar(50) CHARACTER SET utf8 DEFAULT NULL,
  `short` varchar(10) DEFAULT NULL,
  `qq` varchar(20) DEFAULT NULL,
  `new_status` tinyint(3) NOT NULL DEFAULT '0',
  `sid` varchar(11) DEFAULT NULL,
  `department` tinyint(2) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `user_infos`
--

INSERT INTO `user_infos` (`uid`, `realname`, `nickname`, `sex`, `college`, `short`, `qq`, `new_status`, `sid`, `department`) VALUES
(27, '黄冠润', NULL, 1, '信息科学与工程学院', '682650', '204472862', 2, '16115072003', 1),
(21, '余晓鹏', NULL, 1, '经济管理学院', '642742', '740004078', 2, '16101101035', 1),
(22, '吴镜杰', NULL, 1, '信息科学与工程学院', '642767', '1422152595', 2, '16115073004', 1),
(28, '凌活龙', NULL, 1, '物理与机电工程学院', '671093', '1967471283', 2, '17101071016', 1),
(29, '卢健聪', NULL, 1, '物理与机电工程学院', '675389', '1596715459', 2, '17101081022', 1),
(31, '钟晓琳', NULL, 2, '政治与公共事务管理学院', '674178', '2623955813', 2, '17107011079', 1),
(33, '何健祖', NULL, 1, '土木工程学院', NULL, '773981398', 2, '17104062031', 1),
(34, '马秋绿', NULL, 2, '英东食品科学与工程学院', '670510', '953780128', 2, '17129013033', 1),
(333, '邓瑾莲', NULL, 2, '教育学院', '673985', '2963282498', 2, '17114091034', 1),
(50, '何冠鹏', NULL, 1, '体育学院', NULL, '1420283844', 2, '17111014019', 1),
(52, '叶金镕', NULL, 2, '英东食品科学与工程学院', '670690', '907265807', 1, '17129031040', 1),
(53, '蔡荣声', NULL, 1, '数学与统计学院', NULL, '2060808858', 1, NULL, 1),
(54, '刘明杰', NULL, 1, '物理与机电工程学院', '678131', '1271065093', 2, '17101071003', 1),
(56, '朱富鸿', NULL, 1, '信息科学与工程学院', '671516', '1468169244', 1, '17115031045', 1),
(60, '李振', NULL, 1, '英东生命科学学院', '672295', '2650316229', 2, '17118041033', 1),
(63, '钟冠伦', NULL, 1, '旅游与地理学院', '689188', '549521435', 2, '16109061027', 1),
(77, '吴懿', NULL, 1, '食品学院', '670629', '302600081', 1, NULL, 1),
(78, '卢泽智', NULL, 1, '信息科学与工程学院', NULL, '1072316240', 2, '17115073039', 1),
(80, '梁颢耀', NULL, 1, '物理与机电工程学院', '674897', '1925481969', 2, '17101024038', 1),
(83, '林亮', NULL, 1, '物理与机电工程学院', '623098', '1764037195', 2, '16101071040', 1),
(86, '欧东坤', NULL, 1, '数学与统计学院', NULL, '1493155516', 2, '17110031001', 1),
(87, '叶诗诗', NULL, 1, '数学与统计学院', '674014', '1664397420', 1, NULL, 1),
(90, '王瑞', NULL, 1, '物理与机电工程学院', '662942', '2373736890', 2, '16101073001', 1),
(91, '曾嘉威', NULL, 1, '政治与公共事务管理学院', NULL, '1969974531', 2, '17107011080', 1),
(95, '冼志斌', NULL, 1, '物理与机电工程学院', NULL, '616768078', 2, '17101101014', 1),
(96, '朱子龙', NULL, 1, '化学与环境工程学院', NULL, '1803167898', 1, '17104032012', 1),
(100, '汪雨霞', NULL, 2, '数学与统计学院', '674067', '2324692124', 2, '17110041001', 1),
(109, '李月权', NULL, 1, '物理与机电工程学院', NULL, '1098716811', 1, '17101071041', 1),
(110, '黄家鸿', NULL, 1, '物理与机电工程学院', NULL, '2448837560', 1, '17101071005', 1),
(111, '吴磊', NULL, 1, '物理与机电工程学院', NULL, '596717584', 2, '17101071022', 1),
(113, '李日桦', NULL, 1, '物理与机电工程学院', '663283', '837765028', 1, '17101101042', 1),
(115, '欧烨标', NULL, 1, '物理与机电工程学院', '671058', '1083110985', 1, '17101072031', 1),
(116, '蒋冠万', NULL, 1, '物理与机电工程学院', '675408', '2632490139', 2, '17101071015', 1),
(117, '姚家欣', NULL, 1, '物理与机电工程学院', '671041', '764666735', 1, '17101072023', 1),
(118, '郭铭扬', NULL, 1, '物理与机电工程学院', '670769', '3130213701', 2, '17101023034', 1),
(119, '邓光远', NULL, 1, '物理与机电工程学院', '675495', '953644541', 2, '17101023042', 1),
(127, '罗梓涛', NULL, 1, '物理与机电工程学院', '674721', '2868127005', 2, '17101071004', 1),
(129, '李培明', NULL, 1, '物理与机电工程学院', '671133', '1150643446', 2, '17101071048', 1),
(132, '聂红兵', NULL, 1, '物理与机电工程学院', '49074', '2030249091', 2, '17101023049', 1),
(136, '梁栋平', NULL, 1, '物理与机电工程学院', '670867', '1252125071', 2, '17101023044', 1),
(139, '江福', NULL, 1, '物理与机电工程学院', '676133', '997407575', 2, '17101102025', 1),
(140, '曾思瑜', NULL, 2, '英东食品科学与工程学院', '977715', '2469128902', 2, '17129011022', 1),
(141, '郑铭智', NULL, 1, '物理与机电工程学院', '670832', '506769292', 2, '17101021011', 1),
(142, '叶妙欣', NULL, 2, '物理与机电工程学院', '671593', '384978123', 1, '17101071007', 1),
(146, '罗欣怡', NULL, 2, '数学与统计学院', '683369', '870757240', 2, '17110021039', 1),
(147, '萧泽健', NULL, 1, '物理与机电工程学院', NULL, '1771097587', 2, '17101023003', 1),
(149, '赖燚', NULL, 1, '物理与机电工程学院', '639383', '517234140', 2, '17101071019', 1),
(150, '余嘉鑫', NULL, 1, '物理与机电工程学院', '670812', '896409274', 2, '17101023050', 1),
(152, '林泽锴', NULL, 1, '英东食品科学与工程学院', '670703', '798364886', 2, '17129032021', 1),
(155, '黄干凯', NULL, 1, '物理与机电工程学院', '671091', '1909472570', 2, '17101071017', 1),
(157, '陆升豪', NULL, 1, '物理与机电工程学院', '664668', '1470411256', 2, '17101071042', 1),
(161, '梁智明', NULL, 1, '物理与机电工程学院', '671062', '1825846332', 2, '17101071032', 1),
(169, '莫金萍', NULL, 2, '物理与机电工程学院', NULL, '2507125082', 2, '17101091013', 1),
(179, '方健炜', NULL, 1, '信息科学与工程学院', '677477', '373481766', 2, '16115071054', 1),
(182, '苏颖康', NULL, 1, '信息科学与工程学院', NULL, '1391882712', 2, '17115062050', 1),
(185, '麦燕清', NULL, 1, '物理与机电工程学院', NULL, '1940931605', 2, '17101042018', 1),
(186, '陈秋育', NULL, 1, '信息科学与工程学院', NULL, '1906939484', 2, '17115021013', 1),
(189, '吴泳霖', NULL, 2, '旅游与地理学院', '675041', '1353339429', 2, '17109022005', 1),
(190, '彭炜', NULL, 2, '旅游与地理学院', '678858', '010101010', 1, '17109021019', 1),
(191, '苏毓洲', NULL, 1, '信息科学与工程学院', NULL, '1404031711', 2, '17115073059', 1),
(193, '蔡晓洁', NULL, 1, '信息科学与工程学院', NULL, '1300416188', 1, NULL, 1),
(195, '李梓欣', NULL, 2, '土木工程学院', '639864', '2467673987', 1, '17104051050', 1),
(197, '黄祖威', NULL, 1, '信息科学与工程学院', '671506', '690696047', 2, '17115032002', 1),
(198, '罗豪明', NULL, 1, '信息科学与工程学院', '671434', '1060748574', 2, '17115032015', 1),
(199, '郑乔锋', NULL, 1, '信息科学与工程学院', '674335', '2291282646', 1, '17115032047', 1),
(201, '陈浩南', NULL, 1, '物理与机电工程学院', NULL, '506463961', 2, '17101101026', 1),
(206, '汤敬聪', NULL, 1, '化学与环境工程学院', '694133', '846052962', 2, '17104012029', 1),
(212, '庄晓卿', NULL, 2, '政治与公共事务管理学院', '674214', '582695677', 2, '17107032044', 1),
(216, '李晓诚', NULL, 1, '物理与机电工程学院', '671265', '1084952668', 2, '17101102020', 1),
(222, '程晖', NULL, 1, '旅游与地理学院', '669475', '1147939031', 2, '16109061011', 1),
(224, '翁青青', NULL, 2, '教育学院', NULL, '847554362', 2, '17114091028', 1),
(225, '林观麒', NULL, 1, '信息科学与工程学院', NULL, '1129673383', 2, '16115072045', 1),
(226, '欧丽娟', NULL, 2, '政治与公共事务管理学院', NULL, '1345942525', 2, '17107032036', 1),
(227, '郑锋', NULL, 1, '数学与统计学院', NULL, '1149290863', 2, '17110031039', 1),
(229, '李明景', NULL, 1, '信息科学与工程学院', '671155', '1271165028', 2, '17115061047', 1),
(230, '高卓茹', NULL, 2, '教育学院', '674701', '965318195', 2, '17114091071', 1),
(238, '刘永康', NULL, 1, '物理与机电工程学院', '679173', '2707545075', 1, '17101071038', 1),
(240, '陈艳云', NULL, 2, '信息科学与工程学院', NULL, '1549346129', 2, '17115021043', 1),
(245, '黄锦乐', NULL, 1, '物理与机电工程学院', NULL, '1605850475', 2, '17101023059', 1),
(248, '彭彦彬', NULL, 1, '信息科学与工程学院', '671508', '593755659', 2, '17115032042', 1),
(249, '盘柏岐', NULL, 1, '物理与机电工程学院', '670898', '1979221851', 2, '17101021008', 1),
(254, '陈锴霖', NULL, 1, '物理与机电工程学院', '662113', '390329720', 2, '16101072040', 1),
(260, '陈聪贤', NULL, 1, '信息科学与工程学院', NULL, '2184996488', 2, '17115071048', 1),
(261, '王蕴健', NULL, 1, '信息科学与工程学院', '670369', '1849085272', 2, '17115071056', 1),
(263, '李国镔', NULL, 1, '土木工程学院', '672553', '1067397044', 1, '17104063008', 1),
(264, '吴国煌', NULL, 1, '物理与机电工程学院', '670736', '739406132', 2, '17101091006', 1),
(269, '陈勇', NULL, 1, '物理与机电工程学院', '674914', '314315859', 2, '17101023013', 1),
(270, '邵秋月', NULL, 2, '教育学院', '674706', '1434239022', 2, '17114091076', 1),
(274, '张淋柏', NULL, 1, '英东农业科学与工程学院', NULL, '1091024494', 2, '17102101019', 1),
(286, '何蕴泽', NULL, 1, '物理与机电工程学院', NULL, '1315585950', 2, '17101091035', 1),
(292, '陈思鸿', NULL, 1, '信息科学与工程学院', NULL, '654996418', 2, '17215051013', 1),
(294, '许沛松', NULL, 1, '数学与统计学院', '672753', '575804133', 2, '17110031025', 1),
(303, '符然壹', NULL, 2, '信息科学与工程学院', '674259', '1525053329', 2, '17115021007', 1),
(306, '唐钰荣', NULL, 1, '信息科学与工程学院', NULL, '2463604327', 2, '17215051016', 1),
(307, '徐浩源', NULL, 1, '信息科学与工程学院', '670719', '1823605807', 2, '17215051005', 1),
(312, '黄国旺', NULL, 1, '物电学院', '666055', '769170883', 1, NULL, 1),
(314, '张高亮', NULL, 1, '信息科学与工程学院', '654742', '1351019870', 2, '16115072021', 1),
(315, '龚雀', NULL, 1, '信息科学与工程学院', '672850', '2634149526', 2, '16115072047', 1),
(316, '蔡晓玲', NULL, 2, '教育学院', NULL, '2695689632', 2, '17114091027', 1),
(317, '李庆婷', NULL, 2, '法学院', NULL, '1801939554', 2, '17108014037', 1),
(327, '张浩', NULL, 1, '信息科学与工程学院', '671653', '905646794', 2, '17115061032', 1),
(336, '洪德良', NULL, 1, '信息科学与工程学院', NULL, '1392415748', 2, '17115072046', 1),
(337, '庄炎松', NULL, 1, '物理与机电工程学院', '670999', '1377420280', 2, '17101024029', 1),
(339, '许浩星', NULL, 1, '信息科学与工程学院', NULL, '1174988219', 2, '17115072010', 1),
(343, '罗文康', NULL, 1, '物理与机电工程学院', '674827', '841282873', 2, '17101024051', 1),
(345, '陈家欣', NULL, 1, '信息科学与工程学院', '671799', '565444295', 1, NULL, 1),
(346, '蚁少媚', NULL, 1, '信息科学与工程学院', '671779', '1035750673', 1, NULL, 1),
(351, '左贝妮', NULL, 2, '英东农业科学与工程学院', '671581', '493396522', 1, '17102011022', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `homework`
--
ALTER TABLE `homework`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notice`
--
ALTER TABLE `notice`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `homework`
--
ALTER TABLE `homework`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键';

--
-- 使用表AUTO_INCREMENT `notice`
--
ALTER TABLE `notice`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键', AUTO_INCREMENT=114;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
